using System;
using System.Collections.Generic;
using System.Text;

namespace Labs216.Tarskih.Interfaces
{
    interface IChoice // ------------------------------------------------------------------------------------------------------------------------------------------------- Интерфейс выбора
    {
        public void Choice()
        {
            Console.WriteLine("Осуществите выбор");
        }
    }



    interface IMoving // ------------------------------------------------------------------------------------------------------------------------------------------------- Интерфейс движения
    {
        public void Moving()
        {
            Console.WriteLine("Происходит перемещение");
        }
    }



    interface IDamaging // ----------------------------------------------------------------------------------------------------------------------------------------------- Интерфейс нанесения урона
    {
        public void Damaging()
        {
            Console.WriteLine("Происходит нанесение урона");
        }
    }



    interface IGettingDamage // ------------------------------------------------------------------------------------------------------------------------------------------ Интерфейс получения урона
    {
        public void GettingDamage()
        {
            Console.WriteLine("Данный юнит получает урон");
        }
    }


    interface IHealing // ------------------------------------------------------------------------------------------------------------------------------------------------ Интерфейс Лечения
    {
        public void Healing()
        {
            Console.WriteLine("Происходит лечение");
        }
    }



    interface IMessaging // ---------------------------------------------------------------------------------------------------------------------------------------------- Интерфейс передачи сообщения
    {
        public void Messaging()
        {
            Console.WriteLine("Происходит передача сообщения");
        }
    }



    interface IInsiding // ----------------------------------------------------------------------------------------------------------------------------------------------- Интерфейс нахождения внутри
    {
        public void Insiding()
        {
            Console.WriteLine("Происходит нахождение внутри");
        }
    }



    interface IShieldProtection // -------------------------------------------------------------------------------------------------------------------------------------- Интерфейс защиты щитом
    {
        public void ShieldProtection()
        {
            Console.WriteLine("Щит данного юнита поглощает часть урона");
        }
    }



    interface IDistanceDamaging // --------------------------------------------------------------------------------------------------------------------------------------- Дистанционная атака
    {
        public void DistanceAttack()
        {
            Console.WriteLine("Данный юнит совершает атаку на расстоянии");
        }
    }



    interface IDowning // ------------------------------------------------------------------------------------------------------------------------------------------------ Оглушение
    {
        public void Downing()
        {
            Console.WriteLine("Данный юнит совершает оглушение");
        }
    }



    interface IWorking // ------------------------------------------------------------------------------------------------------------------------------------------------ Работа или добыча
    {
        public void Working()
        {
            Console.WriteLine("Данный юнит совершает работу или добычу");
        }
    }



    interface IResting // ------------------------------------------------------------------------------------------------------------------------------------------------ Отдых
    {
        public void Resting()
        {
            Console.WriteLine("Данный юнит отдыхает");
        }
    }



    interface ICRestingPlace // ------------------------------------------------------------------------------------------------------------------------------------------- Место для отдыха
    {
        public void CRestingPlace()
        {
            Console.WriteLine("В этом строении есть место или несколько мест для отдыха");
        }
    }



    interface ICDefendingPlace // ----------------------------------------------------------------------------------------------------------------------------------------- Защита строения
    {
        public void CDefendingPlace()
        {
            Console.WriteLine("С этого строения идёт внутренняя защита");
        }
    }



    interface ICGettingDamagePlace // -------------------------------------------------------------------------------------------------------------------------------------- Получение урона строением
    {
        public void CGettingDamagePlace()
        {
            Console.WriteLine("Это строение получает урон");
        }
    }



    interface ICRestorationPlace // ----------------------------------------------------------------------------------------------------------------------------------------- Восстановление строения
    {
        public void CRestorationPlace()
        {
            Console.WriteLine("Это строение восстанавливается");
        }
    }



    interface ICSafeKeeping // ----------------------------------------------------------------------------------------------------------------------------------------- Хранилище строения
    {
        public void CSafeKeeping()
        {
            Console.WriteLine("Это строение что-то в себе хранит");
        }
    }



    interface ICDestruction // ----------------------------------------------------------------------------------------------------------------------------------------- Разрушение здания
    {
        public void Destruction()
        {
            Console.WriteLine("Состояние здания");
        }
    }
}
